#include <iostream>
using namespace std;

/* การให้ผู้ใช้กำหนดขนาดของอาเรย์ (array) เอง สามารถทำได้โดยใช้ Dynamic Arrays 
ซึ่งเป็นการจัดการหน่วยความจำในช่วงเวลารันไทม์ (runtime) เพื่อสร้างอาเรย์ที่มีขนาดตามที่ผู้ใช้กำหนดได้ 
    เราสามารถใช้คำสั่ง new ในการสร้างอาเรย์ขนาดตามที่ผู้ใช้กำหนด 
    และ delete[] เพื่อคืนหน่วยความจำเมื่อไม่ต้องการใช้งานแล้ว */
    
int main(){
    int size;

    // ให้ผู้ใช้กำหนดขนาดของอาเรย์
    cout << "กรุณากรอกขนาดของอาเรย์: ";
    cin >> size;

    // สร้างอาเรย์ขนาดที่ผู้ใช้กำหนดแบบไดนามิก
    int* arr = new int[size];

     // รับค่าจากผู้ใช้เพื่อใส่ลงในอาเรย์
    cout << "กรุณากรอกตัวเลข " << size << " ตัว: " << endl;
    for (int i = 0; i < size; i++) {
        cin >> arr[i];
    }

    // แสดงผลข้อมูลที่ผู้ใช้กรอก
    cout << "ค่าที่อยู่ในอาเรย์: ";
    for (int i = 0; i < size; i++) {
        cout << arr[i] << " ";
    }
    cout << endl;

    // คืนหน่วยความจำหลังจากใช้งานเสร็จ
    delete[] arr;


    return 0;
}

/* เพิ่มเติม: การใช้คำสั่ง new จะต้องใช้คู่กับ delete[] เมื่อไม่ต้องการใช้งานอาเรย์อีกต่อไป 
เพื่อคืนหน่วยความจำที่จัดสรรไว้ ไม่เช่นนั้นจะเกิดการ "รั่วของหน่วยความจำ" (memory leak) 
ซึ่งหน่วยความจำจะไม่ถูกคืนให้ระบบและไม่สามารถนำไปใช้งานใหม่ได้ */